package com.example.snackdic;

public class MBTILibrary {
    private String mMBTIQuestion[]={
            "여행을 간다면 어떤 일이 있어도 그 지역의 맛집을 방문 해야합니다",//1
            "항상 먹을려는 양보다 요리 혹은 주문을 많이하여 음식이 남습니다",//2
            "눈 앞에 먹을 것이 있다면 아무리 배가 불러도 계속 주워먹습니다",//3
            "호기심 때문에 이상한 종류의 간식을 종종 도전하곤 합니다",//4
            "아무리 배고프더라도 아무거나 먹지 않고 제대로 된 음식을 먹습니다",//5
            "음식을 주문할 때 보통 모자란것 보다 넉넉한게 좋다",//6
            "음식을 섭취한 후에 포만감이 들지 않는다면 먹을거리를 찾아본다",//7
            "선택한 간식이 맛이 없다면 화가납니다",//8
            "음식을 먹었을때 재료에 뭐가 들어갔는지 잘맞추는 편이다",//9
            "먹는데 쓰는 돈은 아깝지 않다",//10
            "먹기위해 운동한다",//11
            "음식을 먹을 때 서로 새로운 것 보다는 익숙한것이 좋습니다",//12
            "먹고싶은 음식이 여러 개라면 친구와 함께 주문하더라도 여러가지메뉴를 주문한다",//13
            "음식점을 찾을 때 가격은 크게 고려하지 않는다",//14
            "양이 많은 음식이라면 뭐든 좋다",//15
            ""
    };

    public String getQuestion(int a){
        String question = mMBTIQuestion[a];
        return question;
    }
}
