package com.example.snackdic;

public class akiLibrary {
    public static final int END=10;

    public static final String[] akiQuestion={
            "얼마까지 사용할 생각입니까?",//1
            "몇명이 함께 먹을것 입니까?",//2
            "배달 또는 요리가 가능하나요?",//3
            "어떤 온도의 간식을 원하시나요?",//4
            "어떤 맛의 간식을 원하시나요?",//5
            "팔도 비빔면을 몇봉지까지 먹을수 잇나요?",//6
            "다음 식사시간까지 남은 시간은?",//7
            "라면을 먹는다면?",//8
            "무언가 씹고싶습니까?",//9
            "햄버거를 먹는다면?"//10
    };//질문
    public static final String[][] akiAnswer={
            {"1500","3000","4500","6000"},//1
            {"1","2","3","4"},//2
            {"x","요리만","배달만","둘다"},//3
            {"차가운 것","따뜻한 것","보통","상관x"},//5
            {"맵","단","짠","상관x"},//6
            {"0.5봉","1봉","2봉","3봉이상"},//7
            {"1시간","2시간","4시간","6시간 이상"},//8
            {"1봉","1봉+밥","2봉","모자름"},//9
            {"배도고픔","보통","배부름","상관없음"},//10
            {"편의점","데리버거","쉑쉑버거","수제버거"}
    };//답변
    public static final int[][] akiScores={
            {5,10,15,20},
            {5,10,15,20},
            {5,10,15,20},
            {20,15,10,5},
            {20,15,10,5}
    };//질문 배점
}
